#+TITLE: Review of C/C++ Basics
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: CSC 240 - Data structures with C++ - Lyon College, FA24
#+STARTUP:overview hideblocks indent
#+OPTIONS: toc:1 num:1 ^:nil
#+PROPERTY: header-args:C++ :main yes :includes <iostream> :results output :exports both :noweb yes
#+PROPERTY: header-args:C :main yes :includes <stdio.h> :results output :exports both :noweb yes
** Solution (complete)

- *Strategy:* The numbers are stored in an array of N = 10 elements. N
  is defined at the start with =#define=. The array is initialized with
  zeros. The numbers are retrieved from standard input with =scanf=
  counting up with a =for= loop, and printed in reverse order with
  =printf= counting down with a =for= loop.

- *Program* =reverse.c=:
  #+begin_src C :tangle reverse.c :main no :includes :cmdline < input
    /**************************************************************/
    // reverse.c: reverse a series of numbers entered by the user
    // Store numbers as int array with scanf in a for loop
    // Print numbers in reverse order with printf in a for loop
    /**************************************************************/
    #include <stdio.h> // include input/output header file
    #define N 10  // define constant array length with directive

    int main() // main program
    {
      int i;           // declare loop variable
      int a[N] = {0};  // macro definition (uses constant N)
      printf("Enter 10 numbers: "); // ask for input
      for ( i = 0; i < N; i++) { // loop over array (counting up)
        scanf("%d", &a[i]); // get the i-th array element from stdin
        printf("%d ", a[i]); // print the i-th array element to stdout
      }
      puts("");  // add new line
      printf("In reverse order: ");
      for ( i = N-1; i >= 0; i--) { // loop over array (counting down)
        printf("%d ", a[i]);
      }
      puts("");
      return 0; // confirm program ran successfully
    } // end of main program
  #+end_src

  #+RESULTS:
  : Enter 10 numbers: 34 82 49 102 2 94 23 11 50 31
  : In reverse order: 31 50 11 23 94 2 102 49 82 34

- To compile and run this program, you have three options[fn:2]:
  1. Add the header argument =:cmdline < input= where =input= is a text
     file containing the test input data. Then run the code block with
     =C-c C-c=. You can create an input file in a shell code block.
  2. Tangle the source code for compilation, debugging and execution
     on the command-line, add the header argument =:tangle reverse.c=,
     tangle with =C-u C-c C-v t= and run it on the command-line shell
     with the chain command: =gcc reverse.c -o rev && ./rev=.
  3. You can also tangle the file as ~reverse.c~ (=C-u C-c C-v t=) and run
     it in a shell code block with the test input:
     #+begin_src bash :results output :exports both
       gcc reverse.c -o rev
       echo 34 82 49 102 2 94 23 11 50 31 | ./rev
     #+end_src

     #+RESULTS:
     : Enter 10 numbers: 34 82 49 102 2 94 23 11 50 31 
     : In reverse order: 31 50 11 23 94 2 102 49 82 34 

     Let's see how this works:
     1) =gcc reverse.c -o rev= compiles the file and creates an output
        file called =rev=
     2) =echo= prints its arguments (the test series) to stdout
     3) The pipe symbol =|= takes the output on its left and serves it
        as stdin on the right.
     4) =./rev= receives the input from the left and runs with it.
     5) The =./= is necessary for the shell to find the executable file
        =rev= in the current directory.
  
- *Notes:*
  1. Is the program proofed against wrong input? Try to break it using
     the command-line executable entering characters or words instead,
     or leave out numbers.
  2. You can use /variable-length arrays/ if you don't want to fix the
     length of the array - but you cannot initialize it (since the
     length of the array is not known at compile-time):
     #+begin_src C :tangle reverse2.c :main yes :includes <stdio.h> :results none :exports both
       int i, n;
       printf("How many numbers do you want to reverse: ");
       scanf("%d", &n);
       int a[n];
       printf("Enter %d numbers: ", n);
       for ( i = 0; i < n; i++) {
         scanf("%d", &a[i]);
        }; puts("");
       printf("In reverse order: ");
       for ( i = n-1; i >= 0; i--) {
         printf("%d ", a[i]);
        }; puts("");
     #+end_src

     Tangle the source file =reverse2.c=, and on the command-line, run:
     #+begin_src bash :results output :exports both
       gcc reverse2.c -o rev2
       echo 4 5 4 3 2 | ./rev2  # output: 2 3 4 5
     #+end_src
  3. We can compute the length of an array =a= using the =sizeof=
     operator, which is useful if we don't know the length[fn:3].
     #+begin_src C :main no
       #define N 10
       #define SIZE (int)(sizeof(a)/sizeof(a[0]))

       int main (void)
       {
         int i;
         int a[N];
         printf("SIZE = %d\n", SIZE);
         for (i = 0; i < SIZE; i++) {
           a[i] = i+1;
           printf("%d ", a[i]);
         }
         return 0;
       }
     #+end_src

     #+RESULTS:
     : SIZE = 10
     : 1 2 3 4 5 6 7 8 9 10

** NEXT Solution (complete)

- *Strategy*: The program uses an array of Boolean values =digits_seen= to
  keep track of which digits 0-9 xappear in a number. Initially, every
  element of the array is =false=. When given a number =n=, the program
  examines its digits one at a time, storing each into the =digit=
  variable, and then using it as an index into =digit_seen=. if
  =digit_seen[digit]= is =true=, then =digit= appears at least twice in
  =n=. If =digit_seen[digit]= is =false=, then =digit= has not been seen
  before, so the program sets =digit_seen[digit= to =true= and keeps
  going.

- *Program* =repdigit.c=:
  #+begin_src C :tangle repdigit.c :main no :includes :results none :exports both
    /*********************************************************/
    // repdigit.c: checks numbers for repeated digits.
    // Input: number with (without) repeated digits.
    // Output: Print "Repeated digit" or "No repeated digit."
    /*********************************************************/
    #include <stdbool.h> // defines `bool` type
    #include <stdio.h>

    int main(void)
    {
      // variable declarations and initialization
      bool digit_seen[10] = {false}; // initialized to zeros = false
      int digit;
      unsigned long int n; // a long unsigned integer type

      // getting user input
      printf("Enter a number: ");
      scanf("%ld", &n);
      puts("");

      // scan input number digit by digit
      while (n > 0) { // loop while n positive
        digit = n % 10; // example output: 28212 % 10 = 3
        if (digit_seen[digit]) // if true then digit repeats
          break; // leave loop
        digit_seen[digit] = true;
        n /= 10; // example output: (int) (28212/10) = (int) 2821.2 = 2821
        } // finishes when (int) single digit / 10 = 0

      // print result
      if (n > 0) // found repeat digit before scanning whole number
        printf("Repeated digit\n");
      else  // n = 0 means scanning finished = all digits seen
        printf("No repeated digit\n");
          
      return 0;
    }
  #+end_src

- Testing:
  #+begin_src bash :results output :exports both
    gcc repdigit.c -o rep
    echo 1987654321 | ./rep
  #+end_src

  #+RESULTS:
  : Enter a number: 
  : Repeated digit

- *Notes*:

